posts/sorting-algorithm/index.org
#+BEGIN_COMMENT
.. title: 常见排序算法总结
.. slug: sorting-algorithm
.. date: 2018-12-24 16:21:50 UTC+08:00
.. tags: algorithm, sort
.. category: algorithm
.. link:
.. description:
.. type: text
、.. status: draft
#+END_COMMENT

#+TITLE: 常见排序算法总结

排序是计算机编程中很常见的操作，本文对常见的排序算法进行了总结，并针对每种算法给出了示例代码。

{{{TEASER_END}}}

** 冒泡排序
从头开始依次对相邻的两个数字比较大小并进行交换，对于 =n= 个数字，最多只需要进行 =n-1= 次交换。
代码示例：
#+BEGIN_SRC cpp
void bubble_sort(vector<int>& nums) {
    if (nums.size() < 2) {
        return;
    }

    for (size_t i=0; i<nums.size()-1; ++i) {
        for (size_t j=0; j+1<nums.size()-i; ++j) {
            if (nums[j] > nums[j+1]) {
                swap(nums[j], nums[j+1]);
            }
        }
    }
}
#+END_SRC


** 插入排序
从第二个元素开始，将该元素插入到已排序数字列的和合适位置。
代码示例：
#+BEGIN_SRC cpp
void insertion_sort(vector<int>& nums) {
    if (nums.size() < 2) {
        return;
    }

    for (size_t i=1; i < nums.size(); ++i) {
        int target = nums[i];
        int j = i - 1; // !!!
        for (; j >= 0; --j) { // !!!
            if (target < nums[j]) {
                nums[j+1] = nums[j];
            }
            else {
                break;
            }
        }
        nums[j+1] = target;
    }
}
#+END_SRC


