posts/sorting-algorithm/index.org
** 选择排序
以从小到大排序为例，选择排序每次从剩下未排序的数字列中选出最小的数字，将其放在已排序数字列的尾部。
代码示例：
#+BEGIN_SRC cpp
void selection_sort(vector<int>& nums) {
    if (nums.size() < 2) {
        return;
    }

    for (size_t i=0; i < nums.size()-1; ++i) {
        int pos = i;
        for (size_t j=i+1; j<nums.size(); ++j) {
            if (nums[pos] > nums[j]) {
                pos = j;
            }
        }
        swap(nums[i], nums[pos]);
    }
}
#+END_SRC


