posts/sorting-algorithm/index.org
** 归并排序
将数字列分不断划分为多个较小的数字列，对较小的数字列按照顺序进行归并，最终实现归并后的数字列是有序的。
归并排序体现了分治法的思想。归并排序的实现有两种：递归方式和非递归方式。

“非递归方式”代码示例：
#+BEGIN_SRC cpp
void merge_sort(vector<int>& nums) {
    // merge
    vector<int> temp;
    temp.resize(nums.size());

    unsigned step = 1; // step 可以从1开始
    while (step < nums.size()) {
        for (size_t i=0; i < nums.size(); ) {
            size_t head1 = i;
            size_t end1 = min(head1 + step, nums.size());
            size_t head2 = end1;
            size_t end2 = min(head2 + step, nums.size());

            while (head1 < end1 && head2 < end2) {
                if (nums[head1] < nums[head2]) {
                    temp[i] = nums[head1];
                    ++head1;
                }
                else {
                    temp[i] = nums[head2];
                    ++head2;
                }
                ++i;
            }

            while (head1 < end1) {
                temp[i] = nums[head1];
                ++head1;
                ++i;
            }

            while (head2 < end2) {
                temp[i] = nums[head2];
                ++head2;
                ++i;
            }
        }
        nums = temp; // optimal
        step *= 2;
    }
}
#+END_SRC

“递归方式”代码示例：
#+BEGIN_SRC cpp
// recursive merge sort
void merge_sort(vector<int>& nums) {
    if (nums.size() < 2) {
        return;
    }
    else if (nums.size() == 2) {
        if (nums[0] > nums[1]) {
            swap(nums[0], nums[1]);
        }
        return;
    }

    // split
    size_t mid = nums.size() / 2;

    // !!! 使用迭代器完成数组拷贝，注意对mid的处理
    vector<int> numLeft(nums.begin(), nums.begin()+mid);
    merge_sort(numLeft);

    vector<int> numRight(nums.begin()+mid, nums.end());
    merge_sort(numRight);

    size_t i = 0;
    size_t l = 0;
    size_t r = 0;
    while (l < numLeft.size() && r < numRight.size()) {
        if (numLeft[l] < numRight[r]) {
            nums[i] = numLeft[l];
            ++l;
        }
        else {
            nums[i] = numRight[r];
            ++r;
        }
        ++i;
    }

    while (l < numLeft.size()) {
        nums[i] = numLeft[l];
        ++l;
        ++i;
    }

    while (r < numRight.size()) {
        nums[i] = numRight[r];
        ++r;
        ++i;
    }
}
#+END_SRC


