posts/sorting-algorithm/index.org
** 快速排序
快速排序与归并排序比较相似，它们都会对所排序的数字列进行分割，对分割后的子数字列进行排序，对排序后的子数字列进行归并。二者的区别在于分割子数字列的方式，快速排序会根据选取的轴点对数字列进行划分，归并排序总会对数字列进行等分。

代码示例：
#+BEGIN_SRC cpp
// qsort的partition是关键
int partition(std::vector<int>& nums, int low, int high) {
    int i = low;
    for (int j=low; j<high; ++j) {
        if (nums[j] < nums[high]) {
            std::swap(nums[i], nums[j]);
            ++i;
        }
    }
    std::swap(nums[i], nums[high]);
    return i;
}

void helper(std::vector<int>& nums, int low, int high) {
    if (low < high) {
        int piv = partition(nums, low, high);
        helper(nums, low, piv-1);
        helper(nums, piv+1, high);
    }
}

void quick_sort(std::vector<int>& nums) {
    helper(nums, 0, nums.size()-1);
}
#+END_SRC


** 排序算法的性能指标
*** 时间复杂度
算法的时间复杂度就是算法的运行速度，是算法性能的重要指标。

| 名称     | 最好  | 平均  | 最坏  |
|----------+-------+-------+-------|
| 冒泡排序 | n     | n^2   | n^2   |
| 插入排序 | n     | n^2   | n^2   |
| 选择排序 | n^2   | n^2   | n^2   |
| 归并排序 | nlogn | nlogn | nlogn |
| 快速排序 | nlogn | nlogn | n^2   |


*** 空间复杂度
算法的空间复杂度表示算法运行时需要的内存空间。

| 名称     | 空间  |
|----------+-------|
| 冒泡排序 | 1     |
| 插入排序 | 1     |
| 选择排序 | 1     |
| 归并排序 | n     |
| 快速排序 | logn  |


*** 稳定性
算法的稳定性主要指相同的元素在排序后，它们的相对位置能够保持不变。
稳定的排序算法：冒泡排序，插入排序，归并排序
不稳定的排序算法：选择排序，快速排序


** 相似排序算法的比较
*** 插入排序和选择排序
插入排序是稳定的算法，而选择排序是不稳定的算法。
在最理想情况下，插入排序的时间复杂度为 =O(n)= ，选择排序的时间复杂度为 =O(n^2)= 。


*** 归并排序和快速排序
归并排序是稳定的算法，而一般的快速排序是不稳定的算法，也存在以稳定的快速排序算法。
在最坏情况下，归并排序的时间复杂度为 =O(nlogn)= ，快速排序的时间复杂度为 =O(n^2)= 。
归并排序需要额外的空间用于存储辅助数据，快速排序并不需要很多额外的空间。

