posts/sorting-algorithm/index.html


<div id="outline-container-org32f7013" class="outline-2">
<h2 id="org32f7013">快速排序</h2>
<div class="outline-text-2" id="text-org32f7013">
<p>
快速排序与归并排序比较相似，它们都会对所排序的数字列进行分割，对分割后的子数字列进行排序，对排序后的子数字列进行归并。二者的区别在于分割子数字列的方式，快速排序会根据选取的轴点对数字列进行划分，归并排序总会对数字列进行等分。<br></p>

<p>
代码示例：<br></p>
<div class="highlight"><pre><span></span><span class="c1">// qsort的partition是关键</span>
<span class="kt">int</span><span class="w"> </span><span class="nf">partition</span><span class="p">(</span><span class="n">std</span><span class="o">::</span><span class="n">vector</span><span class="o">&lt;</span><span class="kt">int</span><span class="o">&gt;&amp;</span><span class="w"> </span><span class="n">nums</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">low</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">high</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="kt">int</span><span class="w"> </span><span class="n">i</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">low</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="k">for</span><span class="w"> </span><span class="p">(</span><span class="kt">int</span><span class="w"> </span><span class="n">j</span><span class="o">=</span><span class="n">low</span><span class="p">;</span><span class="w"> </span><span class="n">j</span><span class="o">&lt;</span><span class="n">high</span><span class="p">;</span><span class="w"> </span><span class="o">++</span><span class="n">j</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">nums</span><span class="p">[</span><span class="n">j</span><span class="p">]</span><span class="w"> </span><span class="o">&lt;</span><span class="w"> </span><span class="n">nums</span><span class="p">[</span><span class="n">high</span><span class="p">])</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	    </span><span class="n">std</span><span class="o">::</span><span class="n">swap</span><span class="p">(</span><span class="n">nums</span><span class="p">[</span><span class="n">i</span><span class="p">],</span><span class="w"> </span><span class="n">nums</span><span class="p">[</span><span class="n">j</span><span class="p">]);</span><span class="w"></span>
<span class="w">	    </span><span class="o">++</span><span class="n">i</span><span class="p">;</span><span class="w"></span>
<span class="w">	</span><span class="p">}</span><span class="w"></span>
<span class="w">    </span><span class="p">}</span><span class="w"></span>
<span class="w">    </span><span class="n">std</span><span class="o">::</span><span class="n">swap</span><span class="p">(</span><span class="n">nums</span><span class="p">[</span><span class="n">i</span><span class="p">],</span><span class="w"> </span><span class="n">nums</span><span class="p">[</span><span class="n">high</span><span class="p">]);</span><span class="w"></span>
<span class="w">    </span><span class="k">return</span><span class="w"> </span><span class="n">i</span><span class="p">;</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>

<span class="kt">void</span><span class="w"> </span><span class="nf">helper</span><span class="p">(</span><span class="n">std</span><span class="o">::</span><span class="n">vector</span><span class="o">&lt;</span><span class="kt">int</span><span class="o">&gt;&amp;</span><span class="w"> </span><span class="n">nums</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">low</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">high</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">low</span><span class="w"> </span><span class="o">&lt;</span><span class="w"> </span><span class="n">high</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	</span><span class="kt">int</span><span class="w"> </span><span class="n">piv</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">partition</span><span class="p">(</span><span class="n">nums</span><span class="p">,</span><span class="w"> </span><span class="n">low</span><span class="p">,</span><span class="w"> </span><span class="n">high</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">helper</span><span class="p">(</span><span class="n">nums</span><span class="p">,</span><span class="w"> </span><span class="n">low</span><span class="p">,</span><span class="w"> </span><span class="n">piv</span><span class="mi">-1</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">helper</span><span class="p">(</span><span class="n">nums</span><span class="p">,</span><span class="w"> </span><span class="n">piv</span><span class="o">+</span><span class="mi">1</span><span class="p">,</span><span class="w"> </span><span class="n">high</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="p">}</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>

<span class="kt">void</span><span class="w"> </span><span class="nf">quick_sort</span><span class="p">(</span><span class="n">std</span><span class="o">::</span><span class="n">vector</span><span class="o">&lt;</span><span class="kt">int</span><span class="o">&gt;&amp;</span><span class="w"> </span><span class="n">nums</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="n">helper</span><span class="p">(</span><span class="n">nums</span><span class="p">,</span><span class="w"> </span><span class="mi">0</span><span class="p">,</span><span class="w"> </span><span class="n">nums</span><span class="p">.</span><span class="n">size</span><span class="p">()</span><span class="mi">-1</span><span class="p">);</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>
</pre></div>
</div>
</div>


<div id="outline-container-orgabe536a" class="outline-2">
<h2 id="orgabe536a">排序算法的性能指标</h2>
<div class="outline-text-2" id="text-orgabe536a">
</div>
<div id="outline-container-org079b285" class="outline-3">
<h3 id="org079b285">时间复杂度</h3>
<div class="outline-text-3" id="text-org079b285">
<p>
算法的时间复杂度就是算法的运行速度，是算法性能的重要指标。<br></p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">最好</th>
<th scope="col" class="org-left">平均</th>
<th scope="col" class="org-left">最坏</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">冒泡排序</td>
<td class="org-left">n</td>
<td class="org-left">n<sup>2</sup>
</td>
<td class="org-left">n<sup>2</sup>
</td>
</tr>
<tr>
<td class="org-left">插入排序</td>
<td class="org-left">n</td>
<td class="org-left">n<sup>2</sup>
</td>
<td class="org-left">n<sup>2</sup>
</td>
</tr>
<tr>
<td class="org-left">选择排序</td>
<td class="org-left">n<sup>2</sup>
</td>
<td class="org-left">n<sup>2</sup>
</td>
<td class="org-left">n<sup>2</sup>
</td>
</tr>
<tr>
<td class="org-left">归并排序</td>
<td class="org-left">nlogn</td>
<td class="org-left">nlogn</td>
<td class="org-left">nlogn</td>
</tr>
<tr>
<td class="org-left">快速排序</td>
<td class="org-left">nlogn</td>
<td class="org-left">nlogn</td>
<td class="org-left">n<sup>2</sup>
</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org3b1c629" class="outline-3">
<h3 id="org3b1c629">空间复杂度</h3>
<div class="outline-text-3" id="text-org3b1c629">
<p>
算法的空间复杂度表示算法运行时需要的内存空间。<br></p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-right">空间</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">冒泡排序</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-left">插入排序</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-left">选择排序</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-left">归并排序</td>
<td class="org-right">n</td>
</tr>
<tr>
<td class="org-left">快速排序</td>
<td class="org-right">logn</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org872edf0" class="outline-3">
<h3 id="org872edf0">稳定性</h3>
<div class="outline-text-3" id="text-org872edf0">
<p>
算法的稳定性主要指相同的元素在排序后，它们的相对位置能够保持不变。<br>
稳定的排序算法：冒泡排序，插入排序，归并排序<br>
不稳定的排序算法：选择排序，快速排序<br></p>
</div>
</div>
</div>


<div id="outline-container-orga37f30e" class="outline-2">
<h2 id="orga37f30e">相似排序算法的比较</h2>
<div class="outline-text-2" id="text-orga37f30e">
</div>
<div id="outline-container-orga4c6c31" class="outline-3">
<h3 id="orga4c6c31">插入排序和选择排序</h3>
<div class="outline-text-3" id="text-orga4c6c31">
<p>
插入排序是稳定的算法，而选择排序是不稳定的算法。<br>
在最理想情况下，插入排序的时间复杂度为 <code>O(n)</code> ，选择排序的时间复杂度为 <code>O(n^2)</code> 。<br></p>
</div>
</div>


<div id="outline-container-org2cf3c42" class="outline-3">
<h3 id="org2cf3c42">归并排序和快速排序</h3>
<div class="outline-text-3" id="text-org2cf3c42">
<p>
归并排序是稳定的算法，而一般的快速排序是不稳定的算法，也存在以稳定的快速排序算法。<br>
在最坏情况下，归并排序的时间复杂度为 <code>O(nlogn)</code> ，快速排序的时间复杂度为 <code>O(n^2)</code> 。<br>
归并排序需要额外的空间用于存储辅助数据，快速排序并不需要很多额外的空间。<br></p>
</div>
</div>
</div>
